[
  {
    "id": "1",
    "title": "Wraps",
    "step 1": "Grill main filling (meal or substitute, cheese...) on the pan or in the oven. ",
    "step 2": "In the meantime chop salad and other fresh veg, put aside.",
    "step 3": "Prepare dressing",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "2",
    "title": "Hummus",
    "step 1": "",
    "step 2": "",
    "step 3": "",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "3",
    "title": "Tortilla de Patatas",
    "step 1": "",
    "step 2": "",
    "step 3": "",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "4",
    "title": "Red Lentil Fritters",
    "step 1": "",
    "step 2": "",
    "step 3": "",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "5",
    "title": "Risotto",
    "step 1": "",
    "step 2": "",
    "step 3": "",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "6",
    "title": "Fresh Salad",
    "step 1": "Chop all vegetables to bite size chunks.",
    "step 2": "Add seeds, roasted tofu or anything else.",
    "step 3": "Add dressing just before serving. A simple dressing is made of 1 part oil (olive oil, tahini, peanut butter), 1 part water, 1 tablespoon acidic (lemon juice, vinegar, mustard), 1/2 teaspoon syrup, 1/2 salt.",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "7",
    "title": "Fish",
    "step 1": "Peel the potatoes, cut into chunks of same size and rinse. Then put in a pot of salted water and bring to boil. Boil for about 20 minutes.",
    "step 2": "In the meantime prepare the fish. Rinse the filets and either bake in the oven or grill on the pan. Don't forget a bit of oil and season with salt and pepper. Bake for few minutes only to not dry it out. ",
    "step 3": "If you are making salad (instead of potatoes or as a side) then chop everything for it and place in a bowl. Add dressing just before serving.",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "8",
    "title": "Couscous Bowl",
    "step 1": "Make couscous by heating up a drizzle of olive oil, roast the couscous for 2 minutes. Then remove from heat and add boiling water and 1/2 teaspoon of salt. Cover and let absorb liquid for 5-10 minutes.",
    "step 2": "Chop all vegetables to bite size chunks.",
    "step 3": "Add seeds, roasted tofu, tuna or anything else.",
    "step 4": "Add dressing just before serving. A simple dressing is made of 1 part oil (olive oil, tahini, peanut butter), 1 part water, 1 tablespoon acidic (lemon juice, vinegar, mustard), 1/2 teaspoon syrup, 1/2 salt.",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "9",
    "title": "Minestrone",
    "step 1": "Chop onion and garlic finely, carrot and tomatoes into small cubes, courgette into half-circles or quarters. ",
    "step 2": "Heat up oil in a larger pot, add the onion and let soften. Add carrot and roast for about 10 minutes. Then add garlic for about a minute and also the tomato puree.",
    "step 3": "Add the stock, tomato passata, tomatoes, bay leaf, thyme, oregano, slat and pepper and bring to boil. When boiling add courgette and boil until courgette is soft (about 5 minutes). ",
    "step 4": "Prepare orzo or other tiny pasta as instructed on the wrapper or by adding it directly in the soup.",
    "step 5": "A minute before finishing add the white beans and season all to taste",
    "step 6": "Serve with fresh basil and parmesan cheese."
  },
  {
    "id": "10",
    "title": "Asian-style Noodle Salad",
    "step 1": "Peel vegetables and either spiralize or cut into noodles shape.",
    "step 2": "Boil noodles as per instructions on wrapper.",
    "step 3": "Chop up the fresh herbs and peanuts.",
    "step 4": "Assemble salad adding roasted tofu or anything else.",
    "step 5": "Add the dressing just before serving. Dressing is made of 2-3 tablespoons of peanut butter, 1 tb lemon juice, 1 teaspoon syrup, 2-3 tablespoons of water, 2 tablespoons soy sauce, 1 garlic clove and optionally chilli. Should be creamy, else add peanut butter.",
    "step 6": ""
  },
  {
    "id ": "11",
    "title ": "Creamy Veggie Soup",
    "step 1 ": "Chop onion finely. Chop other veggies into larger chunks (but small enough to allow blending).",
    "step 2 ": "Heat up oil in a big pot, add the onion and fry until golden, the add veggies and roast for few minutes. ",
    "step 3 ": "Add veggie stock and water so that all veggies are submerged. Salt and season to taste.",
    "step 4 ": "Bring to boil and cook until all veggies are just soft. ",
    "step 5 ": "Turn off heat. Blend using a hand-held blender.",
    "step 6 ": "Stir in the cream, bring back to boil and let simmer for a minute. Add water if too thick, season to taste.",
    "step 7 ": "Serve with bread, croutons or cornbread."
  },
  {
    "id ": "12",
    "title ": "Shakshouka",
    "step 1 ": "Chop onion and garlic finely. Wash and cut red peppers into thn stips.",
    "step 2 ": "Heat up oil in a large pan, fry onion for 1 minute, then add red peppers and roast until soft. Add garlic for the last minute.",
    "step 3 ": "Add chopped tomatoes and all of the spice + salt & pepper. Let cook for about 5 minutes. ",
    "step 4 ": "Reduce heat and create 4 holes with the laddle. Break 1 egg into each hole. Cover the pan with a lid and let the eggs cook as much as you like (5-7mins).",
    "step 5 ": "Serve directly in the pan, with toasted bread.  ",
    "step 6 ": ""
  },
  {
    "id ": "13",
    "title ": "Pizza",
    "step 1 ": "Preaheat oven at 170 degrees fan. Mix tvaroh, flour, eggs and salt. You can use the kitchen robot or just a big bowl and mixing spoon. ",
    "step 2 ": "Spread evenly on a lined baking sheet, making a thin layer. Prebake without any toppings until lightly brown (approx. 15 minutes).",
    "step 3 ": "When prebaked, top with tomato puree, sprinkle with salt or pizza seasoning. Add any toppings and cheese. Bake for another 5-10 minutes until brown.",
    "step 4 ": "",
    "step 5 ": "",
    "step 6 ": ""
  },
  {
    "id ": "14",
    "title ": "Lentil Dahl",
    "step 1 ": "First, in a skillet or saucepan, heat the oil. Toss the chopped onion and sauté for 2-3 minutes until translucent. After that, add the garlic and ginger and sauté for another minute until fragrant. Lastly, add your spices and sauté for a few seconds to bring out the flavors.",
    "step 2 ": "Rinse the lentils under cold running water in a fine-mashed sieve. Then toss them in the skillet with the onion mixture. Add the coconut milk and strained tomatoes (if using), simmer for 10-15 minutes, or until the lentils are tender. Add water / broth if too thick.",
    "step 3 ": "Then, season with salt, pepper coconut sugar, and lime or lemon juice to taste.",
    "step 4 ": "Serve with rice which you can cook in the pressure cooker: rinse 1 cup of rice and add double the amount of cold water. Add salt and close the lid. Set the cooker manually to 20kPa pressure for 3 minutes.",
    "step 5 ": "",
    "step 6 ": ""
  },
  {
    "id ": "15 ",
    "title ": "Clear Noodle Soup ",
    "step 1 ": "Heat up stock and add water to have about 1.5 litres of liquid total. Add any veggies and noodles that you'd like and boil until noodles and veggies are soft. season to taste with salt, pepper, garlic. ",
    "step 2 ": " ",
    "step 3 ": " ",
    "step 4 ": " ",
    "step 5 ": " ",
    "step 6 ": " ",
    "step 7 ": " "
  }
]