[
  {
    "id": "1",
    "title": "Wraps",
    "step 1": "Grill main filling (meal or substitute, cheese...) on the pan or in the oven. ",
    "step 2": "In the meantime chop salad and other fresh veg, put aside.",
    "step 3": "Prepare dressing",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "2",
    "title": "Hummus",
    "step 1": "",
    "step 2": "",
    "step 3": "",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "3",
    "title": "Tortilla de Patatas",
    "step 1": "",
    "step 2": "",
    "step 3": "",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "4",
    "title": "Red Lentil Fritters",
    "step 1": "",
    "step 2": "",
    "step 3": "",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "5",
    "title": "Risotto",
    "step 1": "",
    "step 2": "",
    "step 3": "",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "6",
    "title": "Fresh Salad",
    "step 1": "Chop all vegetables to bite size chunks.",
    "step 2": "Add seeds, roasted tofu or anything else.",
    "step 3": "Add dressing just before serving. A simple dressing is made of 1 part oil (olive oil, tahini, peanut butter), 1 part water, 1 tablespoon acidic (lemon juice, vinegar, mustard), 1/2 teaspoon syrup, 1/2 salt.",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "7",
    "title": "Fish",
    "step 1": "Peel the potatoes, cut into chunks of same size and rinse. Then put in a pot of salted water and bring to boil. Boil for about 20 minutes.",
    "step 2": "In the meantime prepare the fish. Rinse the filets and either bake in the oven or grill on the pan. Don't forget a bit of oil and season with salt and pepper. Bake for few minutes only to not dry it out. ",
    "step 3": "If you are making salad (instead of potatoes or as a side) then chop everything for it and place in a bowl. Add dressing just before serving.",
    "step 4": "",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "8",
    "title": "Couscous Bowl",
    "step 1": "Make couscous by heating up a drizzle of olive oil, roast the couscous for 2 minutes. Then remove from heat and add boiling water and 1/2 teaspoon of salt. Cover and let absorb liquid for 5-10 minutes.",
    "step 2": "Chop all vegetables to bite size chunks.",
    "step 3": "Add seeds, roasted tofu, tuna or anything else.",
    "step 4": "Add dressing just before serving. A simple dressing is made of 1 part oil (olive oil, tahini, peanut butter), 1 part water, 1 tablespoon acidic (lemon juice, vinegar, mustard), 1/2 teaspoon syrup, 1/2 salt.",
    "step 5": "",
    "step 6": ""
  },
  {
    "id": "9",
    "title": "Minestrone",
    "step 1": "Chop onion and garlic finely, carrot and tomatoes into small cubes, courgette into half-circles or quarters. ",
    "step 2": "Heat up oil in a larger pot, add the onion and let soften. Add carrot and roast for about 10 minutes. Then add garlic for about a minute and also the tomato puree.",
    "step 3": "Add the stock, tomato passata, tomatoes, bay leaf, thyme, oregano, slat and pepper and bring to boil. When boiling add courgette and boil until courgette is soft (about 5 minutes). ",
    "step 4": "Prepare orzo or other tiny pasta as instructed on the wrapper or by adding it directly in the soup.",
    "step 5": "A minute before finishing add the white beans and season all to taste",
    "step 6": "Serve with fresh basil and parmesan cheese."
  },
  {
    "id": "10",
    "title": "Asian-style Noodle Salad",
    "step 1": "Peel vegetables and either spiralize or cut into noodles shape.",
    "step 2": "Boil noodles as per instructions on wrapper.",
    "step 3": "Chop up the fresh herbs and peanuts.",
    "step 4": "Assemble salad adding roasted tofu or anything else.",
    "step 5": "Add the dressing just before serving. Dressing is made of 2-3 tablespoons of peanut butter, 1 tb lemon juice, 1 teaspoon syrup, 2-3 tablespoons of water, 2 tablespoons soy sauce, 1 garlic clove and optionally chilli. Should be creamy, else add peanut butter.",
    "step 6": ""
  }
]